# Aprofundado na biblioteca `pandas` do `Python`

In [56]:
# Importando a biblioteca pandas
import pandas as pd

In [57]:
df = pd.DataFrame(
    {
        "Name":[
            "Lucas Ribeiro",
            "Elenice Tizziani",
            "Fernando Tizziani",
            "Karem Nepomuceno",
            "Ana Clara Nepomuceno",
            "Paula vieira",
            "Ciro Nepomuceno",
            "Maria Eduarda Nepomuceno",
            "JOse Caçdeira",
            "Augusta Ribeiro",

    ],
        "idade":[45, 48, 25, 12, 18, 45, 32, 16, 73, 70],
        "cidade":[
            "Araçuai","Capanema",
            "Vilhena","Vilhena",
            "Belo Horizonte","Rio de Janeiro",
            "Araçuai","Curitiba",
            "Araçuai","Araçuai"
        ],
        "estado":[
            "MG","PR",
            "RO","RO",
            "MG","RJ",
            "MG","PR",
            "MG","MG",
        ],
        "sexo":[
            "M","F",
            "M","F",
            "F","F",
            "M","F",
            "M","F"
        ],
        "grau de instrução":[
            "Mestrado","Doutorado",
            "Superior Completo","Ensino Médio",
            "Superior Completo","Ensino Médio",
            "Ensino Fundamental Incompleto","Ensino Médio",
            "Ensino Fundamental Incompleto","Ensino Fundamental Incompleto"
        ],


}
)

In [58]:
df

,Name,idade,cidade,estado,sexo,grau de instrução
0,Lucas Ribeiro,45,Araçuai,MG,M,Mestrado
1,Elenice Tizziani,48,Capanema,PR,F,Doutorado
2,Fernando Tizziani,25,Vilhena,RO,M,Superior Completo
3,Karem Nepomuceno,12,Vilhena,RO,F,Ensino Médio
4,Ana Clara Nepomuceno,18,Belo Horizonte,MG,F,Superior Completo
5,Paula vieira,45,Rio de Janeiro,RJ,F,Ensino Médio
6,Ciro Nepomuceno,32,Araçuai,MG,M,Ensino Fundamental Incompleto
7,Maria Eduarda Nepomuceno,16,Curitiba,PR,F,Ensino Médio
8,JOse Caçdeira,73,Araçuai,MG,M,Ensino Fundamental Incompleto
9,Augusta Ribeiro,70,Araçuai,MG,F,Ensino Fundamental Incompleto

In [59]:
df["idade"]

0    45
1    48
2    25
3    12
4    18
5    45
6    32
7    16
8    73
9    70
Name: idade, dtype: int64

In [60]:
df[["idade", "cidade", "estado"]]

   idade          cidade estado
0     45         Araçuai     MG
1     48        Capanema     PR
2     25         Vilhena     RO
3     12         Vilhena     RO
4     18  Belo Horizonte     MG
5     45  Rio de Janeiro     RJ
6     32         Araçuai     MG
7     16        Curitiba     PR
8     73         Araçuai     MG
9     70         Araçuai     MG

In [61]:
# Series também pode criar um do zero:
idade = pd.Series([45, 48, 25, 12, 18, 45, 80, 16, 73, 70])
idade

0    45
1    48
2    25
3    12
4    18
5    45
6    80
7    16
8    73
9    70
dtype: int64

In [62]:
# saber a idade maxima
df["idade"].max()

np.int64(73)

In [63]:
# imformações estatisticas basicas do dataframe
df.describe()

           idade
count  10.000000
mean   38.400000
std    21.629198
min    12.000000
25%    19.750000
50%    38.500000
75%    47.250000
max    73.000000

# Lendo dados tabulares com a biblioteca `pandas`
O pandas fornece a read_csv()função de ler dados armazenados como um arquivo csv em um pandas DataFrame. 
O pandas suporta muitos formatos de arquivo ou fontes de dados diferentes prontos para uso (csv, excel, sql, json, parquet, …),
 cada um deles com o prefixo read_*.csv()é um dos mais comuns, então vamos ver como ele funciona.

In [64]:
titanic = pd.read_csv("datasets/titanic_completa_oficial.csv")
titanic.head(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22 C26,S,11,?,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.55,C22 C26,S,?,135,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48,0,0,19952,26.55,E12,S,3,?,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63,1,0,13502,77.9583,D7,S,10,?,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39,0,0,112050,0,A36,S,?,?,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53,2,0,11769,51.4792,C101,S,D,?,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71,0,0,PC 17609,49.5042,?,C,?,22,"Montevideo, Uruguay"

In [65]:
# intepretando dados tabulares com a biblioteca `pandas`
titanic.dtypes

pclass        int64
survived      int64
name         object
sex          object
age          object
sibsp         int64
parch         int64
ticket       object
fare         object
cabin        object
embarked     object
boat         object
body         object
home.dest    object
dtype: object

In [66]:
# Resumo dos tipos de dados
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1309 non-null   object
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1309 non-null   object
 9   cabin      1309 non-null   object
 10  embarked   1309 non-null   object
 11  boat       1309 non-null   object
 12  body       1309 non-null   object
 13  home.dest  1309 non-null   object
dtypes: int64(4), object(10)
memory usage: 143.3+ KB

# Seleionado subconjuntos no DataFrame

In [67]:
# Lendo umas unica coluna
age = titanic["age"]
age.head(10)

0        29
1    0.9167
2         2
3        30
4        25
5        48
6        63
7        39
8        53
9        71
Name: age, dtype: object

In [68]:
#Verificndo o tipo de saida
type(titanic["age"])

pandas.core.series.Series

In [69]:
# verificnando o shape de saida
titanic["age"].shape

(1309,)

In [70]:
# verificando mais de uma coluna
titanic[["age", "sex"]].head(10)

      age     sex
0      29  female
1  0.9167    male
2       2  female
3      30    male
4      25  female
5      48    male
6      63  female
7      39    male
8      53  female
9      71    male

In [71]:
# Tipos de dados retornado nas colunas 
type(titanic[["age","sex"]])

pandas.core.frame.DataFrame

In [72]:
titanic[["age", "sex"]].shape

(1309, 2)

# Filtrar linha especifica no Datafram